Passos para realização da atividade:



1.   Leia o arquivo CSV disponível na página da disciplina e apresente o DataFrame completo.
2.   Transforme a coluna nome em índice e reapresente o DataFrame.
3.   Conte quantos elementos nulos existem em cada coluna.
4.   Elimine as linhas com elementos nulos do dataframe.
5.   Mostre os dados da pessoa com nome Francisco.
6.   Calcule o Índice de Massa Corporal, usando a seguinte fórmula IMC = Peso / Altura**2. O valor do IMC deve ser salvo em uma nova coluna do DataFrame.
7.   Mostre o nome e IMC dos homens obesos (IMC maior que 25).
8.   Mostre o nome e IMC das mulheres obesas (IMC maior que 24).

In [1]:
import numpy as np 
import pandas as pd

In [2]:
df = pd.read_csv('datasets\\atv1.csv')
df

         Nome     Genero   Peso  Altura
0        Joao  Masculino  100.0    1.82
1       Maria   Feminino   53.0    2.00
2        Jose  Masculino   61.0     NaN
3        Sara   Feminino   97.0    1.80
4       Paulo  Masculino   63.0    1.72
5     Roberto  Masculino    NaN    1.52
6   Francisco  Masculino   61.0    1.62
7     Leandro  Masculino   64.0    1.74
8       Laura   Feminino   69.0    1.80
9         NaN  Masculino   67.0     NaN
10     Soraia   Feminino   76.0    1.86
11     Gorete   Feminino   96.0    1.84
12  Alexandre  Masculino   56.0    1.90
13    Viviane   Feminino   54.0    1.62
14      Andre  Masculino   63.0    1.80

In [3]:
df = df.set_index('Nome')
df

              Genero   Peso  Altura
Nome
Joao       Masculino  100.0    1.82
Maria       Feminino   53.0    2.00
Jose       Masculino   61.0     NaN
Sara        Feminino   97.0    1.80
Paulo      Masculino   63.0    1.72
Roberto    Masculino    NaN    1.52
Francisco  Masculino   61.0    1.62
Leandro    Masculino   64.0    1.74
Laura       Feminino   69.0    1.80
NaN        Masculino   67.0     NaN
Soraia      Feminino   76.0    1.86
Gorete      Feminino   96.0    1.84
Alexandre  Masculino   56.0    1.90
Viviane     Feminino   54.0    1.62
Andre      Masculino   63.0    1.80

In [4]:
df.isnull().sum()

Genero    0
Peso      1
Altura    2
dtype: int64

In [5]:
df.dropna(inplace=True)
df

              Genero   Peso  Altura
Nome
Joao       Masculino  100.0    1.82
Maria       Feminino   53.0    2.00
Sara        Feminino   97.0    1.80
Paulo      Masculino   63.0    1.72
Francisco  Masculino   61.0    1.62
Leandro    Masculino   64.0    1.74
Laura       Feminino   69.0    1.80
Soraia      Feminino   76.0    1.86
Gorete      Feminino   96.0    1.84
Alexandre  Masculino   56.0    1.90
Viviane     Feminino   54.0    1.62
Andre      Masculino   63.0    1.80

In [6]:
francisco = df.loc['Francisco']
francisco

Genero    Masculino
Peso           61.0
Altura         1.62
Name: Francisco, dtype: object

In [7]:
df['IMC'] = df['Peso'] / (df['Altura'] ** 2)
df

              Genero   Peso  Altura        IMC
Nome
Joao       Masculino  100.0    1.82  30.189591
Maria       Feminino   53.0    2.00  13.250000
Sara        Feminino   97.0    1.80  29.938272
Paulo      Masculino   63.0    1.72  21.295295
Francisco  Masculino   61.0    1.62  23.243408
Leandro    Masculino   64.0    1.74  21.138856
Laura       Feminino   69.0    1.80  21.296296
Soraia      Feminino   76.0    1.86  21.967858
Gorete      Feminino   96.0    1.84  28.355388
Alexandre  Masculino   56.0    1.90  15.512465
Viviane     Feminino   54.0    1.62  20.576132
Andre      Masculino   63.0    1.80  19.444444

In [8]:
df[(df['IMC'] > 25) & (df['Genero'] == 'Masculino')]

         Genero   Peso  Altura        IMC
Nome
Joao  Masculino  100.0    1.82  30.189591

In [9]:
df[(df['IMC'] > 24) & (df['Genero'] == 'Feminino')]

          Genero  Peso  Altura        IMC
Nome
Sara    Feminino  97.0    1.80  29.938272
Gorete  Feminino  96.0    1.84  28.355388